app/views/homepage/index.html.haml

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
-@events.each do |event_id|
  -@event = Event.find(event_id)
  .bg-light.my-3.p-3.rounded-lg