app/controllers/events_controller.rb

  def create
    @event = Event.create!(events_params)
---
INSERT INTO "events" ("name", "description", "location", "contact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["location", ""], ["contact", ""], ["created_at", "2020-05-17 19:09:35.450364"], ["updated_at", "2020-05-17 19:09:35.450364"]]

  def destroy
    @event= Event.find params[:id]
    @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]

  def edit
    @event= Event.find params[:id]
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @event= Event.find params[:id]
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

  def rsvp
    @event= Event.find params[:id]
    @user = current_user
    @rsvp = @user.rsvp.to_s
    @events = @rsvp.split('.').map(&:to_i)

    if !(@events.include? params[:id].to_i)
      @events.push(params[:id].to_i)
      @rsvpv = @events.sort.join('.')
      @user.rsvp = @rsvpv
      @user.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "rsvp" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["rsvp", "1"], ["updated_at", "2020-05-17 03:23:46.935799"], ["id", 1]]