app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Devansh Das"], ["email", "devanshdas08@gmail.com"], ["created_at", "2020-04-21 10:36:48.448725"], ["updated_at", "2020-04-21 10:36:48.448725"]]
INSERT INTO "authorizations" ("user_id", "uid", "provider", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["uid", "11164176"], ["provider", "github"], ["created_at", "2020-04-21 10:36:48.488727"], ["updated_at", "2020-04-21 10:36:48.488727"]]
---

            else # User is registering with a given provider
                # Check the user email and if not BU go to failure path
                user = User.create_with_omniauth(auth_hash['info'])
                if user.email.split('@')[1] == 'binghamton.edu'
                  auth = user.authorizations.create_with_omniauth(auth_hash)