app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "bnumber" = ?, "course_level" = ?, "major" = ?, "dob" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bnumber", "B00815785"], ["course_level", "Grad"], ["major", "CS"], ["dob", "1993-08-14"], ["updated_at", "2020-05-17 18:15:51.724245"], ["id", 1]]
---
  def update
    @user = User.find params[:id]
    @user.update_attributes!(user_params)